Repository: mantas2020/citon
Catalog: languages/*.po
Languages: lt_lt

source: Sorry, but nothing matched your search terms. Please try again with some different keywords.
lt_lt: Atsiprašome, tačiau nieko neradome, pagal pateiktą užklausą

source: Reply
lt_lt: Atsakyti

source: Do you have any questions? Write to us
lt_lt: Turite klausimų? Parašykite mums

source: More information
lt_lt: Daugiau informacijos

source: Our friends
lt_lt: Mūsų draugai

source: We invite you to visit
lt_lt: Kviečiame apsilankyti

source: All News
lt_lt: Visos naujienos

source: Older posts
lt_lt: Ankstesnis

source: Newer posts
lt_lt: Sekantis

source: Search Results for
lt_lt: Paieškos rezultatai

source: Register
lt_lt: Rezervuokite paslaugą

source: Search Results for: %s
lt_lt: Paieškos rezultatai pagal užklausą: %s

source: Search
lt_lt: Ieškoti

source: All rights reserved
lt_lt: Visos teisės saugomos

source: No results found.
lt_lt: Rezultatų nerasta

source: SEARCH RESULTS FOR
lt_lt: Rezultatai

source: No Responses to
lt_lt: Komentarų nėra puslapyje -

source: Submit Comment
lt_lt: Siųsti atsiliepimą

source: Leave a Reply
lt_lt: Palikite atsiliepimą apie mus

source: One Response to
lt_lt: Yra vienas komentaras puslapyje -

source: % Responses to
lt_lt: % atsiliepimų puslapyje -

source: Leave a Reply to %s
lt_lt: Atsakyti į %s komentarą

source: Tags
lt_lt: Žymos
